Revit 2024 API
DuctSettings.GetSpecificFittingAngles Method
 Gets the list of specific fitting angles.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public IList<double> GetSpecificFittingAngles()
Visual Basic
Public Function GetSpecificFittingAngles As IList(Of Double)
Visual C++
public:
IList<double>^ GetSpecificFittingAngles()
Return Value
 Angles (in degrees).
Remarks
 Revit will only use the angles specified during the pipe layout or modifying the pipe layout. When laying out the pipes, if the angle between two pipes is close to the allowed angle, the specific angle is used for that pipe fitting.
See Also
DuctSettings Class
Autodesk.Revit.DB.Mechanical Namespace